app/views/powers/edit.html.erb

SELECT "heroines".* FROM "heroines"
---
    <label> Select Heroine: </label><br>
    <%= f.collection_check_boxes :heroines, Heroine.all, :id, :name %><br>