app/views/heroines/edit.html.erb

    <%= f.text_field :super_name %><br><br>
    <%= f.collection_select(:power_id, Power.all, :id, :name, prompt: true) %>
---
SELECT "powers".* FROM "powers"