app/views/heroines/new.html.erb

    <label> Heroine Super Power: </label><br>
    <%= f.select :powers, Power.all.collect { |power| power.name } %><br>
---
SELECT "powers".* FROM "powers"