app/views/heroines/show.html.erb

SELECT "powers".* FROM "powers" INNER JOIN "heroines_powers" ON "powers"."id" = "heroines_powers"."power_id" WHERE "heroines_powers"."heroine_id" = ?  [["heroine_id", 6]]
---
<h3><%= @heroine.name %></h3><br>
<%= @heroine.powers.each do |power| %>