app/controllers/heroines_controller.rb

  def index
    @heroines = Heroine.all
---
SELECT "heroines".* FROM "heroines"

  def create
    # binding.pry
    @heroine = Heroine.new(heroine_params)

    if @heroine.valid?
      @heroine.save
---
INSERT INTO "heroines" ("name", "super_name", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Linda Carter"], ["super_name", "Super Schnoz"], ["power_id", 3], ["created_at", "2020-04-09 17:16:08.349780"], ["updated_at", "2020-04-09 17:16:08.349780"]]

  def find_heroine
    @heroine = Heroine.find(params[:id])
---
SELECT  "heroines".* FROM "heroines" WHERE "heroines"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]