app/controllers/powers_controller.rb

  def index
    @powers = Power.all
---
SELECT "powers".* FROM "powers"

  def show
    @power = Power.find(params[:id])
---
SELECT  "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @power = Power.find(params[:id])
---
SELECT  "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @power = Power.find(params[:id])

    changes = params.require(:power).permit(:name, :description, :heroines => [])
    changes[:heroines].shift
    heros = changes[:heroines].map do |heroine| heroine = Heroine.find(heroine.to_i) end
---
SELECT  "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "heroines".* FROM "heroines" WHERE "heroines"."id" IN (1, 3, 10)